package mybang2;

public class Kyesan {

	public static void main(String[] args) {
		
		/*
		 int -> 길이(4byte), type(정수)이 결정됨
		 				4byte: -2147483648 ~ +2147483647 까지 넣을 수 있음
		 				2byte: -32768 ~ +32767
		 				
		 	0 			-> 00000000000000000000000000
		 	1 			-> 00000000000000000000000001
		 	-1			-> 11111111111111111111111111 (음수중에 가장 큰 수)
		 	2147483647	-> 01111111111111111111111111
		 	-2147483648 -> 10000000000000000000000000 (음수 중에 가장 작은 수)
		 */
		
//		int su1 = 2147483648; //범위 넘어가서 에러
		int su1 = 2147483647;								//0 111111111111111111111
		int su2 = 1;										//0 000000000000000000001
															//+ 
															//------------------------
		int su3 = su1 + su2; //이것도 범위 넘어가는데 에러는 안뜸		//1 000000000000000000000
		//이런 에러는 표시가 안나기 때문의 주의
		
		System.out.println("su1: " + su1);
		System.out.println("su2: " + su2);
		System.out.println("su3 = su1 + su2 :" + su3);

	}

}
